; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-17)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room5)
(at ball14 room5)
(at ball15 room5)
(at ball16 room6)
(at ball17 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 3 of 17
2. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 3 of 17
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 3 of 17
4. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 4 of 17
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 17
6. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 4 of 17
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 4 of 17
8. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 5 of 17
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 5 of 17
10. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 5 of 17
11. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 5 of 17
12. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 5 of 17
13. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 6 of 17
14. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 6 of 17
15. (pick ball17 room6 left)
   deleted: (at ball17 room6) (free left)
   added: (carry ball17 left)
   goals met: 6 of 17
16. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 6 of 17
17. (drop ball17 rooma left)
   deleted: (carry ball17 left)
   added: (at ball17 rooma) (free left)
   goals met: 7 of 17
18. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 7 of 17
19. (pick ball16 room6 left)
   deleted: (at ball16 room6) (free left)
   added: (carry ball16 left)
   goals met: 7 of 17
20. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 7 of 17
21. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 7 of 17
22. (drop ball16 rooma left)
   deleted: (carry ball16 left)
   added: (at ball16 rooma) (free left)
   goals met: 8 of 17
23. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 8 of 17
24. (pick ball15 room5 left)
   deleted: (at ball15 room5) (free left)
   added: (carry ball15 left)
   goals met: 8 of 17
25. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 8 of 17
26. (drop ball15 rooma left)
   deleted: (carry ball15 left)
   added: (at ball15 rooma) (free left)
   goals met: 9 of 17
27. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 9 of 17
28. (pick ball14 room5 left)
   deleted: (at ball14 room5) (free left)
   added: (carry ball14 left)
   goals met: 9 of 17
29. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 9 of 17
30. (drop ball14 rooma left)
   deleted: (carry ball14 left)
   added: (at ball14 rooma) (free left)
   goals met: 10 of 17
31. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 10 of 17
32. (pick ball13 room5 left)
   deleted: (at ball13 room5) (free left)
   added: (carry ball13 left)
   goals met: 10 of 17
33. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 10 of 17
34. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 10 of 17
35. (drop ball13 rooma left)
   deleted: (carry ball13 left)
   added: (at ball13 rooma) (free left)
   goals met: 11 of 17
36. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 11 of 17
37. (pick ball12 room4 left)
   deleted: (at ball12 room4) (free left)
   added: (carry ball12 left)
   goals met: 11 of 17
38. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 11 of 17
39. (drop ball12 rooma left)
   deleted: (carry ball12 left)
   added: (at ball12 rooma) (free left)
   goals met: 12 of 17
40. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 12 of 17
41. (pick ball11 room4 left)
   deleted: (at ball11 room4) (free left)
   added: (carry ball11 left)
   goals met: 12 of 17
42. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 12 of 17
43. (drop ball11 rooma left)
   deleted: (carry ball11 left)
   added: (at ball11 rooma) (free left)
   goals met: 13 of 17
44. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 13 of 17
45. (pick ball10 room4 left)
   deleted: (at ball10 room4) (free left)
   added: (carry ball10 left)
   goals met: 13 of 17
46. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 13 of 17
47. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 13 of 17
48. (drop ball10 rooma left)
   deleted: (carry ball10 left)
   added: (at ball10 rooma) (free left)
   goals met: 14 of 17
49. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 14 of 17
50. (pick ball9 room3 left)
   deleted: (at ball9 room3) (free left)
   added: (carry ball9 left)
   goals met: 14 of 17
51. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 14 of 17
52. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 15 of 17
53. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 15 of 17
54. (pick ball8 room3 left)
   deleted: (at ball8 room3) (free left)
   added: (carry ball8 left)
   goals met: 15 of 17
55. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 15 of 17
56. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 16 of 17
57. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 16 of 17
58. (pick ball7 room3 left)
   deleted: (at ball7 room3) (free left)
   added: (carry ball7 left)
   goals met: 16 of 17
59. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 16 of 17
60. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 17 of 17
